/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <string.h>
#include    <hi_std.h>

/**********************************************************************/
/*  指定アドレス削除関数 - area_delete                                */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   指定されたアドレスの情報を、削除する。                           */
/**********************************************************************/
vd  area_delete( struct ifa_s *ifa )    /* 指定アドレス出力関数       */
{
    li           ret         ;          /* リターンコード(汎用)       */
    li           st_adr      ;          /* 開始アドレス数値           */
    li           ed_adr      ;          /* 終了アドレス数値           */
    li           number      ;          /* 削除データサイズ           */
    li           data_offset ;          /* データオフセット           */
    ch           st_str[32]  ;          /* 開始アドレス文字列         */
    ch           ed_str[32]  ;          /* 終了アドレス文字列         */
    ch           cmd_str[32] ;          /* コマンド文字列(ワーク)     */

    trace_start( ifa, "area_delete" ) ; /* トレース取得               */
/* ------------------------------------------------------------------ */
/* コマンド文字列のフォーマット変換                                   */
/* ------------------------------------------------------------------ */
    strlcpy( cmd_str, ifa->cmd_str, sizeof( cmd_str ) ) ;
                                        /* コマンド文字列のコピー     */
    cmd_str[strlen(cmd_str)-1] = ' ' ;  /* コマンド[x]を' 'に変換     */
    if ( strchr( cmd_str, ((li)',') ) != NULL ) {
                                        /* 区切り文字','がある        */
        *strchr( cmd_str, ((li)',') ) = ' ' ;
                                        /* 区切り文字','を' 'に変換   */
        ret = sscanf( cmd_str, "%s %s", st_str, ed_str ) ;
                                        /* 分解後文字列の取得         */
    }                                   /* end if                     */
    else {                              /* 区切り文字','がない        */
        ret = sscanf( cmd_str, "%s", st_str ) ;
                                        /* 分解後文字列の取得         */
        strlcpy( ed_str, st_str, sizeof( ed_str ) ) ;
                                        /* 終了アドレスの設定         */
    }                                   /* end else                   */

/* ------------------------------------------------------------------ */
/* 開始アドレス取得                                                   */
/* ------------------------------------------------------------------ */
    if ( strncmp(st_str, CNTL_CMD_ADRS, 2) == 0 ) {
                                        /* 16進数指定                 */
        sscanf( st_str, "%x", &st_adr ) ;
                                        /* 開始アドレスの取得         */
    }                                   /* end if                     */
    else if (( st_str[0] == CNTL_CMD_TOP )||
             ( st_str[0] == CNTL_CMD_CRNT )||
             ( st_str[0] == CNTL_CMD_LAST )) {
                                        /* 正規表現指定               */
        hi_regex( ifa, st_str, (ul *)&st_adr, sizeof ( st_adr ) ) ;
                                        /* 正規表現解析関数           */
    }                                   /* end else if                */
    else {                              /* 10進数指定                 */
        sscanf( st_str, "%d", &st_adr ) ;
                                        /* 開始アドレスの取得         */
    }                                   /* end else                   */

/* ------------------------------------------------------------------ */
/* 終了アドレス取得                                                   */
/* ------------------------------------------------------------------ */
    if ( strncmp(ed_str, CNTL_CMD_ADRS, 2) == 0 ) {
                                        /* 16進数指定                 */
        sscanf( ed_str, "%x", &ed_adr ) ;
                                        /* 終了アドレスの取得         */
    }                                   /* end if                     */
    else if (( ed_str[0] == CNTL_CMD_TOP )||
             ( ed_str[0] == CNTL_CMD_CRNT )||
             ( ed_str[0] == CNTL_CMD_LAST )) {
                                        /* 正規表現指定               */
        hi_regex( ifa, ed_str, (ul *)&ed_adr, sizeof ( ed_adr ) ) ;
                                        /* 正規表現解析関数           */
    }                                   /* end else if                */
    else {                              /* 10進数指定                 */
        sscanf( ed_str, "%d", &ed_adr ) ;
                                        /* 終了アドレスの取得         */
    }                                   /* end else                   */

    number = ed_adr - st_adr + 1 ;      /* 削除データサイズ取得       */

/* ------------------------------------------------------------------ */
/* 削除データサイズチェック                                           */
/* ------------------------------------------------------------------ */
    if ( number <= 0 ) {                /* 削除データサイズ不正       */
        snprintf( ifa->err_msg, sizeof( ifa->err_msg ),
                  "delete command error : \"%s\" is delete size <= 0",
                  ifa->cmd_str ) ;      /* エラーメッセージ設定       */
        ERRINFO_SET( ifa ) ;            /* 障害情報詳細設定           */
        err_msg( ifa ) ;                /* エラーメッセージ表示       */
        trace_end( ifa ) ;              /* トレース取得               */
        return ;                        /* return - area_delete       */
    }                                   /* end if                     */

/* ------------------------------------------------------------------ */
/* カーソル位置再計算                                                 */
/* ------------------------------------------------------------------ */
    if ( ifa->data_offset == 1 ) {      /* カーソル位置は先頭         */
        data_offset = ifa->data_offset ;/* データオフセットの退避     */
    }                                   /* end if                     */
    else if ( ( ( ifa->data_offset - 1 ) >= st_adr )&&
              ( ( ifa->data_offset - 1 ) <= ed_adr ) ) {
                                        /* カーソル位置データを削除   */
        data_offset = st_adr ;          /* 開始アドレスを設定         */
    }                                   /* end if                     */
    else {                              /* カーソル位置データは残る   */
        if ( ( ifa->data_offset - 1 ) > st_adr ) {
                                        /* カーソル位置より前を削除   */
            data_offset = ifa->data_offset - number ;
                                        /* データオフセットの退避     */
        }                               /* end if                     */
        else {                          /* カーソル位置より後ろを削除 */
            data_offset = ifa->data_offset ;
                                        /* データオフセットの退避     */
        }                               /* end else                   */
    }                                   /* end else                   */
    ifa->data_offset = ( st_adr + 1 ) ; /* データオフセットの更新     */

/* ------------------------------------------------------------------ */
/* 指定データ削除                                                     */
/* ------------------------------------------------------------------ */
    if ( ifa->target == HEX_DATA ) {    /* HEXデータエリア            */
        repeat_h_del( ifa, number ) ;   /* 連続データ削除関数(HEX)    */
    }                                   /* end if                     */
    else {                              /* 文字データエリア           */
        repeat_c_del( ifa, number ) ;   /* 連続データ削除関数(文字)   */
    }                                   /* end else                   */

/* ------------------------------------------------------------------ */
/* カーソル位置復元                                                   */
/* ------------------------------------------------------------------ */
    ifa->data_offset = data_offset ;    /* データオフセットの復元     */
    cur_pos_set( ifa ) ;                /* カーソル位置再設定         */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - area_delete       */
}                                       /* end (area_delete)          */

/**********************************************************************/
