/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <string.h>
#include    <hi_std.h>

/**********************************************************************/
/*  バイナリエディタ関数 - binary_edit                                */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   初期データを表示し、コマンド受付モードに遷移する。               */
/**********************************************************************/
vd  binary_edit( struct ifa_s *ifa )    /* バイナリエディタ関数       */
{
    ch           kind[16] ;             /* 種類                       */
    ch           mode[16] ;             /* モード                     */
    ch           aces[32] ;             /* アクセスモード             */
    ch           file[256] ;            /* ファイル名                 */

    trace_start( ifa, "binary_edit" ) ; /* トレース取得               */
    strlcpy(file, ifa->file, sizeof( file ) );
    if(strlen(file) > 64){
        snprintf( file, sizeof( file ), "%s...", file);
    }
/* ------------------------------------------------------------------ */
/* 初期カーソル位置を設定する                                         */
/* ------------------------------------------------------------------ */
    ifa->cur_pos_y = BASE_Y ;           /* カーソル位置(Y座標)の設定  */
    if ( ifa->target == HEX_DATA ) {    /* カーソルポジションが HEX   */
        ifa->cur_pos_x = BASE_X2 ;      /* カーソル位置(X座標)の設定  */
    }                                   /* end if                     */
    else {                              /* カーソルポジションが CHAE  */
        ifa->cur_pos_x = BASE_X3 ;      /* カーソル位置(X座標)の設定  */
    }                                   /* end else                   */

/* ------------------------------------------------------------------ */
/* 初期データの表示                                                   */
/* ------------------------------------------------------------------ */
    data_view( ifa ) ;                  /* 初期データ表示             */

/* ------------------------------------------------------------------ */
/* 情報設定                                                           */
/* ------------------------------------------------------------------ */
    if ( ifa->option == FIL ) {         /* 操作対象が、ファイル       */
        if ( ifa->exist == EXIST ) {    /* 対象ファイルが存在する     */
            strlcpy(kind, "ordinary file", sizeof( kind ) ) ;
                                        /* 種類の設定                 */
        }                               /* end if                     */
        else {                          /* 対象ファイルが存在しない   */
            strlcpy(kind, "new file", sizeof( kind ) ) ;
                                        /* 種類の設定                 */
        }                               /* end else                   */
        strlcpy(aces, "indirect access mode", sizeof( aces ) ) ;
                                        /* アクセスモードの設定       */
    }                                   /* end if                     */
    else {                              /* 操作対象が、共有メモリ     */
        strlcpy(kind, "shared memory", sizeof( kind ) ) ;
                                        /* 種類の設定                 */
        strlcpy(aces, "direct access mode", sizeof( aces ) ) ;
                                        /* アクセスモードの設定       */
    }                                   /* end else                   */
    strlcpy(mode, "read/write", sizeof( mode ) ) ;
                                        /* モードの設定               */

/* ------------------------------------------------------------------ */
/* インフォメーションの表示                                           */
/* ------------------------------------------------------------------ */
    if ( ifa->option == FIL ) {         /* 操作対象が、ファイル       */
        snprintf( ifa->inf_msg, sizeof( ifa->inf_msg ), 
                  "\"%s\", %s, %d bytes, %s, %s ",
                  file, kind, ifa->size, mode, aces) ;
                                        /* インフォメーション設定     */
    }                                   /* end if                     */
    else {                              /* 操作対象が、共有メモリ     */
        snprintf( ifa->inf_msg, sizeof( ifa->inf_msg ), 
                  "\"%s\", %s, %d bytes, %s, %s ",
                  ifa->shmid, kind, ifa->size, mode, aces) ;
                                        /* インフォメーション設定     */
    }                                   /* end else                   */
    inf_msg( ifa ) ;                    /* インフォメーション表示     */

/* ------------------------------------------------------------------ */
/* コマンドモード開始                                                 */
/* ------------------------------------------------------------------ */
    while ( ifa->endflg == CONTINUE ) {
                                        /* 処理継続指示の場合         */
        strlcpy(ifa->mode_msg, MODE_STR_CMD, sizeof( ifa->mode_msg ) ) ;
                                        /* モード設定                 */
        mode_dsp( ifa ) ;               /* モード表示                 */
        mode_cmd( ifa ) ;               /* コマンドモード関数         */
    }                                   /* end while                  */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - binary_edit       */
}                                       /* end (binary_edit)          */

/**********************************************************************/
