/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Date    : Dec 1998                                            */
/* @(#) Version : 2.0                                                 */
/* @(#) Release : 1                                                   */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  カーソル右移動関数(文字) - cur_move_c_l                           */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソルを右移動し、ウィンドウを再描画する。(文字)               */
/**********************************************************************/
vd  cur_move_c_l( struct ifa_s *ifa )   /* カーソル右移動関数(文字)   */
{
    li           pos_tail ;             /* データ表示領域の下         */
    li           pos_left ;             /* データ表示領域の左         */
    li           pos_right ;            /* データ表示領域の右         */

    trace_start( ifa, "cur_move_c_l" ) ;/* トレース取得               */
/* ------------------------------------------------------------------ */
/* カーソルを右に移動                                                 */
/* ------------------------------------------------------------------ */
    pos_tail  = ifa->lines - 2 ;        /* 最終行の設定               */
    pos_left  = BASE_X3 ;               /* 左端の設定                 */
    pos_right = pos_left + 14 ;         /* 右端の設定                 */

    if ( ifa->data_offset < ifa->size ) {
                                        /* 未表示データ有り           */
        if ( ifa->cur_pos_x > pos_right ) {
                                        /* カーソル位置が、一番右     */
            if ( ifa->cur_pos_y < pos_tail ) {
                                        /* カーソル位置が、最終行以外 */
                ifa->data_offset++ ;    /* データオフセットの更新     */
                ifa->cur_pos_x = pos_left ;
                                        /* カーソル位置(X座標)の更新  */
                ifa->cur_pos_y++ ;      /* カーソル位置(Y座標)の更新  */
            }                           /* end if                     */
            else if ( ifa->size > ( ifa->view_offset + 16 ) ) {
                                        /* カーソルが最終行で、未表示 */
                                        /* データ有り                 */
                ifa->cur_pos_x = pos_left ;
                                        /* カーソル位置(X)の設定      */
                ifa->data_offset++ ;    /* データオフセットの更新     */
                ifa->view_offset += 16 ;/* 表示オフセットの更新       */
                data_view( ifa ) ;      /* データ表示                 */
            }                           /* end else if                */
        }                               /* end if                     */
        else {                          /* カーソル位置が、一番右以外 */
            ifa->data_offset++ ;        /* データオフセットの更新     */
            ifa->cur_pos_x++ ;          /* カーソル位置(X座標)の更新  */
        }                               /* end else                   */
        move(OFST_Y, OFST_X) ;          /* カーソル移動               */
        printw("%08x", ifa->data_offset - 1) ;
                                        /* オフセットの表示           */
        move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
        refresh() ;                     /* ウィンドウ再描画           */
    }                                   /* end if                     */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - cur_move_l        */
}                                       /* end (cur_move_l)           */

/**********************************************************************/
