/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Date    : Dec 1998                                            */
/* @(#) Version : 2.0                                                 */
/* @(#) Release : 1                                                   */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  カーソル上移動関数(文字) - cur_move_c_k                           */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソルを上移動し、ウィンドウを再描画する。(文字)               */
/**********************************************************************/
vd  cur_move_c_k( struct ifa_s *ifa )   /* カーソル上移動関数(文字)   */
{
    li           pos_top  ;             /* データ表示領域の上         */

    trace_start( ifa, "cur_move_c_k" ) ;/* トレース取得               */
/* ------------------------------------------------------------------ */
/* カーソルを上に移動                                                 */
/* ------------------------------------------------------------------ */
    pos_top = BASE_Y ;                  /* 先頭行の設定               */

    if ( ( ifa->data_offset - 16 ) >= 1 ) {
                                        /* 未表示データ有り           */
        if ( ifa->cur_pos_y > pos_top ) {
                                        /* カーソル位置が、先頭行以外 */
            ifa->data_offset -= 16 ;    /* データオフセットの更新     */
            ifa->cur_pos_y-- ;          /* カーソル位置(Y座標)の更新  */
        }                               /* end if                     */
        else if ( ifa->view_offset > 0 ) {
                                        /* カーソルが先頭行で、未表示 */
                                        /* データ有り                 */
            ifa->data_offset -= 16 ;    /* データオフセットの更新     */
            ifa->view_offset -= 16 ;    /* 表示オフセットの更新       */
            data_view( ifa ) ;          /* データ表示                 */
        }                               /* end else if                */
        move(OFST_Y, OFST_X) ;          /* カーソル移動               */
        printw("%08x", ifa->data_offset - 1) ;
                                        /* オフセットの表示           */
        move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
        refresh() ;                     /* ウィンドウ再描画           */
    }                                   /* end if                     */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - cur_move_k        */
}                                       /* end (cur_move_k)           */

/**********************************************************************/
