/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  カーソル位置切替関数 - cur_pos_move                               */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソル表示位置の切替(HEXと文字)を行う。                        */
/**********************************************************************/
vd  cur_pos_move( struct ifa_s *ifa )   /* カーソル位置切替関数       */
{

    trace_start( ifa, "cur_pos_move" ) ;/* トレース取得               */
/* ------------------------------------------------------------------ */
/* カーソル表示位置を切替える                                         */
/* ------------------------------------------------------------------ */
    if ( ifa->target == HEX_DATA ) {    /* HEXデータ位置              */
        ifa->target = CHAR_DATA ;       /* 文字データ位置に移動       */
        ifa->cur_pos_x = BASE_X3 + ( ( ifa->cur_pos_x - BASE_X2 ) / 3 ) ;
                                        /* カーソル位置(X座標)の再設定*/
    }                                   /* end if                     */
    else {                              /* 文字データ位置             */
        ifa->target = HEX_DATA ;        /* HEXデータ位置に移動        */
        ifa->hex_pos = CUR_LEFT ;       /* 上位バイトに移動           */
        ifa->cur_pos_x = BASE_X2 + ( ( ifa->cur_pos_x - BASE_X3 ) * 3 ) ;
                                        /* カーソル位置(X座標)の再設定*/
    }                                   /* end else                   */

    move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル表示位置を文字へ   */
    refresh() ;                         /* ウィンドウ再描画           */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - cur_move_h        */
}                                       /* end (cur_move_h)           */

/**********************************************************************/
