/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  カーソル位置設定 - cur_pos_set                                    */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソル位置を、現在の表示位置に設定する。                       */
/**********************************************************************/
vd  cur_pos_set( struct ifa_s *ifa )    /* カーソル位置設定関数       */
{
    li           offset ;               /* オフセット                 */

    trace_start( ifa, "cur_pos_set" ) ; /* トレース取得               */
/* ------------------------------------------------------------------ */
/* オフセットの表示                                                   */
/* ------------------------------------------------------------------ */
    move(OFST_Y, OFST_X) ;              /* カーソル移動               */
    if ( ifa->data_offset == 0 ) {      /* カーソル位置が、先頭       */
        printw("%08x", ifa->data_offset) ;
                                        /* オフセットの表示           */
    }                                   /* end if                     */   
    else {                              /* カーソル位置が、先頭以外   */
        printw("%08x", ifa->data_offset - 1) ;
                                        /* オフセットの表示           */
    }                                   /* end else                   */

/* ------------------------------------------------------------------ */
/* カーソル位置の計算を行う                                           */
/* ------------------------------------------------------------------ */
    offset = ifa->data_offset - ifa->view_offset ;
                                        /* 画面左上からのオフセット   */
    if ( ifa->target == HEX_DATA ) {    /* HEXデータエリア            */
        if ( ( offset % 16 ) == 0 ) {   /* 行の最終位置               */
            ifa->cur_pos_x = BASE_X2 + ( 15 * 3 ) ;
                                        /* カーソル位置(X)の設定      */
        }                               /* end if                     */
        else {                          /* 行の最終位置以外           */
            ifa->cur_pos_x = BASE_X2 + ( offset % 16 ) * 3 - 3 ;
                                        /* カーソル位置(X)の設定      */
        }                               /* end if                     */
        ifa->hex_pos = CUR_LEFT ;       /* カーソル位置は、上位バイト */
    }                                   /* end if                     */
    else {                              /* 文字データエリア           */
        if ( ( offset % 16 ) == 0 ) {   /* 行の最終位置               */
            ifa->cur_pos_x = BASE_X3 + 15 ;
                                        /* カーソル位置(X)の設定      */
        }                               /* end if                     */
        else {                          /* 行の最終位置以外           */
            ifa->cur_pos_x = BASE_X3 + ( offset % 16 ) - 1 ;
                                        /* カーソル位置(X)の設定      */
        }                               /* end if                     */
    }                                   /* end else                   */
    if ( offset <= 16 ) {               /* 先頭行                     */
        ifa->cur_pos_y = BASE_Y ;       /* カーソル位置(Y)の設定      */
    }                                   /* end if                     */
    else {                              /* 先頭行以外                 */
        ifa->cur_pos_y = ( offset / 16 ) + BASE_Y ;
                                        /* カーソル位置(Y)の計算      */
    }                                   /* end else                   */
    move( ifa->cur_pos_y, ifa->cur_pos_x ) ;
                                        /* カーソル移動               */
    refresh() ;                         /* ウィンドウ再描画           */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - cur_pos_set       */
}                                       /* end (cur_pos_set)          */

/**********************************************************************/
