/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  カーソル左移動関数(HEX) - cur_move_h_h                            */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソルを左移動し、ウィンドウを再描画する。(HEXデータ用)        */
/**********************************************************************/
vd  cur_move_h_h( struct ifa_s *ifa )   /* カーソル左移動関数(HEX)    */
{
    li           pos_top  ;             /* データ表示領域の上         */
    li           pos_left ;             /* データ表示領域の左         */
    li           pos_right ;            /* データ表示領域の右         */

    trace_start( ifa, "cur_move_h_h" ) ;/* トレース取得               */
/* ------------------------------------------------------------------ */
/* カーソルを左に移動                                                 */
/* ------------------------------------------------------------------ */
    pos_top   = 1 ;                     /* 先頭行の設定               */
    pos_left  = BASE_X2 ;               /* 左端の設定                 */
    pos_right = pos_left + ( 3 * 15 ) + 1 ;
                                        /* 右端の設定                 */

    if ( ifa->hex_pos == CUR_RIGHT ) {  /* 下位バイトをポイント中     */
        ifa->cur_pos_x-- ;              /* カーソルを上位バイトへ移動 */
        ifa->hex_pos = CUR_LEFT ;       /* 上位バイトをポイントした事 */
                                        /* を覚える                   */
    }                                   /* end if                     */
    else {                              /* 下位バイトをポイント中     */
        if ( ifa->data_offset > 1 ) {   /* 未表示データ有り           */
            if ( ifa->cur_pos_x <= pos_left ) {
                                        /* カーソル位置が、一番左     */
                if ( ifa->cur_pos_y > pos_top ) {
                                        /* カーソル位置が、先頭行以外 */
                    ifa->data_offset-- ;/* データオフセットの更新     */
                    ifa->cur_pos_x = pos_right ;
                                        /* カーソル位置(X座標)の更新  */
                    ifa->cur_pos_y-- ;  /* カーソル位置(Y座標)の更新  */
                }                       /* end if                     */
                else if ( ifa->view_offset > 0 ) {
                                        /* カーソルが先頭行で、未表示 */
                                        /* データ有り                 */
                    ifa->cur_pos_x = pos_right ;
                                        /* カーソル位置(X)の設定      */
                    ifa->data_offset-- ;/* データオフセットの更新     */
                    ifa->view_offset -= 16 ;
                                        /* 表示オフセットの更新       */
                    data_view( ifa ) ;  /* データ表示                 */
                }                       /* end else if                */
            }                           /* end if                     */
            else {                      /* カーソル位置が、一番左以外 */
                ifa->data_offset-- ;    /* データオフセットの更新     */
                ifa->cur_pos_x -= 2 ;   /* カーソル位置(X座標)の更新  */
            }                           /* end else                   */
            ifa->hex_pos = CUR_RIGHT ;  /* 下位バイトをポイントした事 */
                                        /* を覚える                   */
        }                               /* end if                     */
        move(OFST_Y, OFST_X) ;          /* カーソル移動               */
        printw("%08x", ifa->data_offset - 1) ;
                                        /* オフセットの表示           */
        move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
        refresh() ;                     /* ウィンドウ再描画           */
    }                                   /* end else                   */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - cur_move_h        */
}                                       /* end (cur_move_h)           */

/**********************************************************************/
