/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <string.h>
#include    <hi_std.h>

/**********************************************************************/
/*  データ変換関数(単一:HEX) - edit_h_rep_1                           */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソル位置の、データ変換を行う。                               */
/**********************************************************************/
vd  edit_h_rep_1( struct ifa_s *ifa )   /* データ変換関数(単一:HEX)   */
{
    li           data ;                 /* 入力データ領域             */

    trace_start( ifa, "edit_h_rep_1" ) ;/* トレース取得               */
/* ------------------------------------------------------------------ */
/* インフォメーション表示                                             */
/* ------------------------------------------------------------------ */
    strlcpy( ifa->mode_msg, MODE_STR_REP, sizeof( ifa->mode_msg ) ) ;
                                        /* モード設定                 */
    mode_dsp( ifa ) ;                   /* モード表示                 */

/* ------------------------------------------------------------------ */
/* 入力データの取得と判定                                             */
/* ------------------------------------------------------------------ */
    data = getch() ;                    /* 入力データ(上位バイト)取得 */
    if ( data != ESCAPE ) {             /* キャンセル以外             */
        if ( ( ( (ch)data < '0' ) || ( (ch)data > '9' ) ) &&
             ( ( (ch)data < 'a' ) || ( (ch)data > 'f' ) ) ) {
                                        /* 16進データ以外             */
            strlcpy( ifa->err_msg, "Input data error",
                     sizeof( ifa->err_msg ) ) ;
                                        /* エラーメッセージ設定       */
            ERRINFO_SET( ifa ) ;        /* 障害情報詳細設定           */
            err_msg( ifa ) ;            /* エラーメッセージ表示       */
        }                               /* end if                     */
        else {                          /* 16進データ                 */
            if ( ifa->hex_pos == CUR_LEFT ) {
                                        /* カーソル位置が、上位バイト */
                LEFT_DATA_SET((ifa->workarea[(ifa->data_offset-1)]),
                              (data)) ;
                                        /* 取得したデータの格納       */
            }                           /* end if                     */
            else {                      /* カーソル位置が、下位バイト */
                RIGHT_DATA_SET((ifa->workarea[(ifa->data_offset-1)]),
                               (data)) ;
                                        /* 取得したデータの格納       */
            }                           /* end else                   */
            data_view( ifa ) ;          /* データ表示関数             */
            ifa->modif = MOD_ON ;       /* 修正した事を覚える         */
        }                               /* end else                   */
    }                                   /* end if                     */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - edit_h_rep_1      */
}                                       /* end (edit_h_rep_1)         */

/**********************************************************************/
