/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <string.h>
#include    <hi_std.h>

/**********************************************************************/
/*  データ変換関数(複数:文字) - edit_c_rep_2                          */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソル位置から、連続したデータの変換を行う。                   */
/**********************************************************************/
vd  edit_c_rep_2( struct ifa_s *ifa )   /* データ変換関数(複数:文字)  */
{
    li           data ;                 /* 入力データ領域             */
    li           pos_tail ;             /* データ表示領域の下         */
    li           pos_left ;             /* データ表示領域の左         */
    li           pos_right ;            /* データ表示領域の右         */

#include    <hi_ebcdic.h>

    trace_start( ifa, "edit_c_rep_2" ) ;/* トレース取得               */
/* ------------------------------------------------------------------ */
/* 初期設定                                                           */
/* ------------------------------------------------------------------ */
    pos_tail  = ifa->lines - 2 ;        /* 最終行の設定               */
    pos_left  = BASE_X3 ;               /* 左端の設定                 */
    pos_right = pos_left + 14 ;         /* 右端の設定                 */

/* ------------------------------------------------------------------ */
/* インフォメーション表示                                             */
/* ------------------------------------------------------------------ */
    strlcpy( ifa->mode_msg, MODE_STR_REP, sizeof( ifa->mode_msg) ) ;
                                        /* モード設定                 */
    mode_dsp( ifa ) ;                   /* モード表示                 */

/* ------------------------------------------------------------------ */
/* 変更データの判定                                                   */
/* ------------------------------------------------------------------ */
    if ( ifa->size == 0 ) {             /* 変更データが、存在しない   */
        strlcpy( ifa->err_msg, "Replace data nothing", sizeof( ifa->err_msg) ) ;
                                        /* エラーメッセージ設定       */
        ERRINFO_SET( ifa ) ;            /* 障害情報詳細設定           */
        err_msg( ifa ) ;                /* エラーメッセージ表示       */
        trace_end( ifa ) ;              /* トレース取得               */
        return ;                        /* return - edit_c_rep_2      */
    }                                   /* end if                     */

/* ------------------------------------------------------------------ */
/* 入力データの取得と判定                                             */
/* ------------------------------------------------------------------ */
    while ( 1 ) {                       /* 無限ループに突入           */
        data = getch() ;                /* 入力データ(１文字)取得     */
        if ( data == ESCAPE ) {         /* 編集モード終了             */
            cur_move_c_h( ifa ) ;       /* カーソル左移動関数(文字)   */
            break ;                     /* break while                */
        }                               /* end if                     */

        if ( ( (uc)data < 0x20 ) || ( (uc)data > 0x7e ) ) {
                                        /* 不可視文字の入力           */
            strlcpy( ifa->err_msg, "Input data error", sizeof( ifa->err_msg) ) ;
                                        /* エラーメッセージ設定       */
            ERRINFO_SET( ifa ) ;        /* 障害情報詳細設定           */
            err_msg( ifa ) ;            /* エラーメッセージ表示       */
            break ;                     /* break while                */
        }                               /* end if                     */

        if ( ifa->lang == LANG_EBCDIC ) {
                                        /* EBCDIC(K)の時は変換が必要  */
            ASCII_TO_EBCDIC( data, ifa->ebcdic ) ;
                                        /* 変換 [ ASCII → EBCDIC ]   */
        }                               /* end if                     */
        ifa->workarea[(ifa->data_offset-1)] = (uc)data ;
                                        /* 取得したデータの格納       */
/* ------------------------------------------------------------------ */
/* カーソル位置の判定                                                 */
/* ------------------------------------------------------------------ */
        if ( ifa->size != ifa->data_offset ) {
                                        /* 作業領域内                 */
            ifa->data_offset++ ;        /* データオフセット値の更新   */
            if ( ifa->cur_pos_x > pos_right ) {
                                        /* カーソル位置が、一番右     */
                ifa->cur_pos_x = pos_left ;
                                        /* カーソル位置(X)の設定      */
                if ( ifa->cur_pos_y < pos_tail ) {
                                        /* カーソル位置が、最終行以外 */
                    ifa->cur_pos_y++ ;  /* カーソル位置(Y)の設定      */
                }                       /* end if                     */
                else {                  /* カーソル位置が、最終行     */
                    ifa->view_offset += 16 ;
                                        /* ウィンドウのスクロール     */
                }                       /* end else                   */
            }                           /* end if                     */
            else {                      /* 行の最終位置以外           */
                ifa->cur_pos_x++ ;      /* カーソル位置(X)の設定      */
            }                           /* end else                   */
        }                               /* end if                     */

/* ------------------------------------------------------------------ */
/* データの再表示                                                     */
/* ------------------------------------------------------------------ */
        data_view( ifa ) ;              /* データ表示関数             */

        ifa->modif = MOD_ON ;           /* 修正した事を覚える         */
    }                                   /* end while                  */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - edit_c_rep_2      */
}                                       /* end (edit_c_rep_2)         */

/**********************************************************************/
