/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : May 2004                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 0t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004 Tatsuyoshi                                   */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <string.h>
#include    <hi_std.h>

/**********************************************************************/
/*  制御コマンド関数 - get_cmd                                        */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   制御コマンドを取得する。                                         */
/**********************************************************************/
vd  get_cmd( struct ifa_s *ifa )        /* 制御コマンド関数           */
{

    trace_start( ifa, "get_cmd" ) ;     /* トレース取得               */
/* ------------------------------------------------------------------ */
/* 制御コマンド処理                                                   */
/* ------------------------------------------------------------------ */
    echo() ;                            /* エコー入力モード           */
    move( ifa->cur_cmd_y, ifa->cur_cmd_x ) ;
                                        /* カーソル位置をコマンド行へ */
    clrtoeol() ;                        /* コマンド行のクリア         */
    addch( (ch)ifa->cmd ) ;             /* 制御コマンド文字の表示     */
    refresh() ;                         /* 画面の再描画               */
    getnstr( ifa->cmd_str, 63 ) ;       /* 制御コマンドを取得         */
    ifa->cmd_size = strlen( ifa->cmd_str ) ;
                                        /* コマンドサイズの設定       */
    move( ifa->cur_cmd_y, ifa->cur_cmd_x ) ;
                                        /* カーソル位置をコマンド行へ */
    clrtoeol() ;                        /* コマンド行のクリア         */
    move( ifa->cur_pos_y, ifa->cur_pos_x ) ;
                                        /* カーソル位置を戻す         */
    noecho() ;                          /* エコー入力モード解除       */

    if ( ifa->cmd_size != 0 ) {         /* コマンド文字列指定有り     */
        exec_get_cmd( ifa ) ;           /* 制御コマンドの実行         */
    }                                   /* end if                     */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - get_cmd           */
}                                       /* end (get_cmd)              */

/**********************************************************************/
