/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : May 2004                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 0t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004 Tatsuyoshi                                   */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  半ページスクロール関数(上) - half_page_up                         */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   半ページ単位のスクロール(上)を行う。                             */
/**********************************************************************/
vd  half_page_up( struct ifa_s *ifa )   /* 半ページスクロール関数(上) */
{
    trace_start( ifa, "half_page_up" ) ;/* トレース取得               */
/* ------------------------------------------------------------------ */
/* ページのスクロール                                                 */
/* ------------------------------------------------------------------ */
    ifa->data_offset -= ( ( ( ifa->lines - (BASE_Y + 2) ) / 2 ) * 16 ) ;
                                        /* データオフセットの更新     */
    if ( ifa->data_offset > 1 ) {       /* ページスクロール(上)可能   */
        ifa->view_offset -= ( ( ( ifa->lines - (BASE_Y + 2) ) / 2 ) * 16 ) ;
                                        /* 表示オフセットの更新       */
        if ( ifa->data_offset < 0 ){    /* fix by tatsuyoshi          */
            ifa->data_offset = 0 ;
            ifa->cur_pos_y = (ifa->data_offset / 16) + (BASE_Y);
        }
        data_view( ifa ) ;              /* データ表示                 */
    }                                   /* end if                     */
    else {                              /* 先頭データへ移動           */
        top_view( ifa ) ;               /* 先頭表示関数               */
    }                                   /* end else                   */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - half_page_up      */
}                                       /* end (half_page_up)         */

/**********************************************************************/
