/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <string.h>
#include    <hi_std.h>

/**********************************************************************/
/*  ヘルプ関数 - help                                                 */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   ヘルプの画面表示を行う。                                         */
/**********************************************************************/
vd  help( struct ifa_s *ifa )           /* ヘルプ関数                 */
{
    li                  line_cnt     ;  /* 対象ヘルプ行               */
    li                  top[256]     ;  /* 対象ページの先頭行         */
    li                  page         ;  /* 対象ページ                 */
    li                  last_page    ;  /* 最終ページ                 */
    ul                  cnt          ;  /* ループカウンタ             */
    li                  hed1_pos_x   ;  /* ヘッダ1表示(X)             */
    li                  hed1_pos_y   ;  /* ヘッダ1表示(Y)             */
    li                  hed2_pos_x   ;  /* ヘッダ2表示(X)             */
    li                  hed2_pos_y   ;  /* ヘッダ2表示(Y)             */
    li                  inf_pos_x    ;  /* インフォメーション表示(X)  */
    li                  inf_pos_y    ;  /* インフォメーション表示(Y)  */
    li                  pos_x        ;  /* 表示座標(X)                */
    li                  pos_y        ;  /* 表示座標(Y)                */
    ch                  end_flg      ;  /* 終了フラグ                 */
    ch                  check_flg    ;  /* チェックフラグ             */
    ch                  head_str[80] ;  /* チェックフラグ             */
    struct help_info_s *help_info    ;  /* ヘルプ情報エリア           */

    trace_start( ifa, "help" ) ;        /* トレース取得               */
/* ------------------------------------------------------------------ */
/* ヘルプファイルチェック                                             */
/* ------------------------------------------------------------------ */
    if ( ifa->help_area == 0x00 ) {     /* ヘルプファイルを未展開     */
        help_read( ifa ) ;              /* ヘルプファイル読み込み関数 */
    }                                   /* end if                     */

/* ------------------------------------------------------------------ */
/* 初期設定                                                           */
/* ------------------------------------------------------------------ */
    snprintf( head_str, sizeof( head_str ),
              " online manual - binary editor ver %s-%s ",
             VERSION, RELEASE ) ;       /* ヘッダ1文字列生成          */
    page = 0 ;                          /* 対象ページの初期化         */
    last_page = -1 ;                    /* 最終ページの初期化         */
    for ( cnt = 0 ; cnt < ifa->help_line ; cnt += ( ifa->lines - 4 ) ) {
        top[++last_page] = cnt ;        /* 対象ページの先頭行の初期化 */
    }                                   /* end if                     */
    end_flg = 0 ;                       /* 終了フラグの初期化         */
    hed1_pos_x = ( ifa->columns - strlen( head_str ) ) / 2 ;
                                        /* ヘッダ1座標(X)             */
    hed1_pos_y = 0 ;                    /* ヘッダ1座標(Y)             */
    hed2_pos_x = ifa->columns - 16 ;    /* ヘッダ2座標(X)             */
    hed2_pos_y = 0 ;                    /* ヘッダ2座標(Y)             */
    inf_pos_x = ifa->columns - 43 ;     /* インフォメーション座標(X)  */
    inf_pos_y = ifa->lines - 1 ;        /* インフォメーション座標(Y)  */
    pos_x = 0 ;                         /* ヘルプ座標(X)              */
    help_info = (struct help_info_s *)ifa->help_area ;
                                        /* ヘルプ情報エリアの設定     */
/* ------------------------------------------------------------------ */
/* ヘルプコマンド実行処理                                             */
/* ------------------------------------------------------------------ */
    while ( end_flg != 1 ) {            /* 終了指示までループ         */

        clear() ;                       /* ウィンドウのクリア         */

/* ------------------------------------------------------------------ */
/* ヘッダ部の表示                                                     */
/* ------------------------------------------------------------------ */
        standout() ;                    /* 強調モード開始             */
        move( hed1_pos_y, hed1_pos_x ) ;/* ヘッダ1位置に、カーソル移動*/
        printw( "%s", head_str ) ;      /* ヘッダ1表示                */
        standend() ;                    /* 強調モード終了             */
        move( hed2_pos_y, hed2_pos_x ) ;/* ヘッダ2位置に、カーソル移動*/
        printw( "[ %2d / %2d ] page", (page+1), (last_page+1) ) ;
                                       /* ヘッダ表示                 */
        for ( cnt = 0 ; cnt < ifa->columns ; cnt++ ) {
                                        /* 桁数分のループ             */
            mvaddch( ( hed1_pos_y + 1 ) , cnt, '-' ) ;
                                        /* 水平線の描画               */
        }                               /* end for                    */

/* ------------------------------------------------------------------ */
/* ヘルプ情報の表示                                                   */
/* ------------------------------------------------------------------ */
        for ( line_cnt = top[page], cnt = 0, pos_y = 2 ;
              cnt < ( ifa->lines - 4 ) ;
              cnt++, pos_y++, line_cnt++ ) {
                                        /* ヘルプの表示               */
            if ( line_cnt >= ifa->help_line ) {
                                        /* ヘルプ情報の最後           */
                break ;                 /* break for                  */
            }                           /* end if                     */
            move( pos_y, pos_x ) ;      /* カーソルの移動             */
            if ( help_info[line_cnt].stand == '1' ) {
                                        /* 強調モード指定             */
                standout() ;            /* 強調モード開始             */
                printw(" %s ", help_info[line_cnt].help_msg) ;
                                        /* 対象行の表示               */
                standend() ;            /* 強調モード終了             */
            }                           /* end if                     */
            else {                      /* 強調モード未指定           */
                printw("%s", help_info[line_cnt].help_msg) ;
                                        /* 対象行の表示               */
            }                           /* end else                   */
        }                               /* end for                    */

/* ------------------------------------------------------------------ */
/* インフォメーション情報の表示                                       */
/* ------------------------------------------------------------------ */
        for ( cnt = 0 ; cnt < ifa->columns ; cnt++ ) {
                                        /* 桁数分のループ             */
            mvaddch( ( inf_pos_y - 1 ) , cnt, '-' ) ;
        }                               /* end for                    */
        mvaddstr( inf_pos_y, inf_pos_x, HELP_INFO ) ;
                                        /* インフォメーション表示     */
        refresh() ;                     /* ウィンドウの再描画         */

/* ------------------------------------------------------------------ */
/* コマンド受付と判定                                                 */
/* ------------------------------------------------------------------ */
        check_flg = 0 ;                 /* チェックフラグの初期化     */
        while ( check_flg != 1 ) {      /* チェックOKまでループ       */
            switch ( getch() ) {        /* コマンドの取得と振り分け   */
                case HELP_CMD_NEXT :    /* 次ページ表示               */
                    if ( page < last_page ) {
                                        /* 次ページ有り               */
                        page++ ;        /* 対象ページの更新           */
                        check_flg = 1 ; /* チェックOK                 */
                    }                   /* end if                     */
                    break ;             /* break switch               */

                case HELP_CMD_PREV :    /* 前ページ表示               */
                    if ( page > 0 ) {   /* 前ページ有り               */
                        page-- ;        /* 対象ページの更新           */
                        check_flg = 1 ; /* チェックOK                 */
                    }                   /* end if                     */
                    break ;             /* break switch               */

                case HELP_CMD_QUIT :    /* ヘルプ終了                 */
                    end_flg = 1 ;       /* 終了フラグの更新           */
                    check_flg = 1 ;     /* チェックOK                 */
                    break ;             /* break switch               */

                default :               /* 入力コマンド不正           */
                    break ;             /* break switch               */
            }                           /* end switch                 */
        }                               /* end while                  */
    }                                   /* end while                  */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - help              */
}                                       /* end (help)                 */

/**********************************************************************/
