/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Jun 2004                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 2t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004 Tatsuyoshi                                   */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <stdlib.h>
#include    <sys/types.h>
#include    <sys/ipc.h>
#include    <sys/shm.h>
#include    <hi_std.h>

/**********************************************************************/
/*  終了処理関数 - hi_end                                             */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーサスの終了処理を行う。                                       */
/**********************************************************************/
vd  hi_end( struct ifa_s *ifa )         /* 終了処理関数               */
{

    trace_start( ifa, "hi_end" ) ;      /* トレース取得               */
/* ------------------------------------------------------------------ */
/* ウィンドウの終了                                                   */
/* ------------------------------------------------------------------ */
    if ( ifa->curses == INIT ) {        /* カーサス初期化済み         */
        keypad( ifa->win, FALSE ) ;     /* キーマップの割り当てを解除 */
        intrflush( ifa->win, TRUE ) ;   /* 割り込みキーを解除         */
        nocrmode() ;                    /* 入力モード制御の終了       */
        nl() ;                          /* 復帰改行モードのセット     */
        echo() ;                        /* エコー入力モード           */
        nocbreak() ;                    /* cbreakモードの解除         */
        endwin() ;                      /* 編集ウィンドウの終了       */
    }                                   /* end if                     */
    printf("\n");

/* ------------------------------------------------------------------ */
/* バイナリエディタ終了                                               */
/* ------------------------------------------------------------------ */
    if (( ifa->endflg == N_END )||
        ( ifa->endflg == D_END )||
        ( ifa->endflg == ABORT )) {     /* 終了指示の場合             */
        if ( ifa->workarea != 0x00 ) {  /* 領域確保済み               */
            if ( ifa->option == FIL ) { /* 操作対象が、ファイル       */
                free( ifa->workarea ) ; /* 作業領域の解放             */
            }                           /* end if                     */
            else {                      /* 操作対象が、共有メモリ     */
                (void)shmdt( ifa->workarea ) ;
                                        /* 共有メモリのデタッチ       */
            }                           /* end if                     */
        }                               /* end if                     */
        if ( ( ifa->help_area != ifa->err_msg ) &&
             ( ifa->help_area != 0x00 ) ) {
                                        /* 領域確保済み               */
            free( ifa->help_area ) ;    /* ヘルプ情報エリアの解放     */
        }                               /* end if                     */
        if ( ifa->search_info != 0x00 ) {
                                        /* 領域確保済み               */
            free( ifa->search_info ) ;  /* 検索文字列情報エリアの解放 */
        }                               /* end if                     */
    }                                   /* end if                     */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* end program - hi_end       */
}                                       /* end (hi_end)               */

/**********************************************************************/
