/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Date    : Dec 1998 - Oct 2000                                 */
/* @(#) Version : 2.2                                                 */
/* @(#) Release : 1                                                   */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  EBCDIC表示関数 - lang_ascii_ebcdic                                */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   文字データを、変換 [ EBCDIC → ASCII ] してから表示する。        */
/**********************************************************************/
vd  lang_ascii_ebcdic( struct ifa_s *ifa )
                                        /* EBCDIC表示関数             */
{
    li           cnt         ;          /* ループカウンタ             */
    li           pos_x       ;          /* X座標                      */
    li           pos_y       ;          /* Y座標                      */
    uc           char_data   ;          /* 文字データ                 */

#include    <hi_ebcdic.h>

    trace_start( ifa, "lang_ascii_ebcdic" ) ;
                                        /* トレース取得               */
/* ------------------------------------------------------------------ */
/* 初期設定                                                           */
/* ------------------------------------------------------------------ */
    pos_x = BASE_X3 ;                   /* ベース座標(X)の設定        */
    pos_y = BASE_Y ;                    /* ベース座標(Y)の設定        */

/* ------------------------------------------------------------------ */
/* データの表示                                                       */
/* ------------------------------------------------------------------ */
    for ( cnt = ifa->view_offset ; cnt < ifa->size ; cnt++ ) {
                                        /* 全データの処理             */
        if ( pos_y == ( ifa->lines - 1 ) ) {
                                        /* 最終行                     */
            break ;                     /* データ表示の終了           */
        }                               /* end if                     */

/* ------------------------------------------------------------------ */
/* 不可視文字を点(.)に変換する                                        */
/* ------------------------------------------------------------------ */
        char_data = ifa->workarea[cnt] ;/* 文字の取得                 */
        EBCDIC_TO_ASCII( char_data, ifa->ebcdic ) ;
                                        /* 変換 [ EBCDIC → ASCII ]   */
        if (( char_data < 0x20 )||( char_data > 0x7e )) {
                                        /* 不可視文字                 */
            char_data = TEN ;           /* 不可視文字の為,(.)に変換   */
        }                               /* end if                     */
        move(pos_y, pos_x) ; printw("%c", char_data) ;
                                        /* 16進データの表示           */
        pos_x++ ;                       /* 文字データ表示位置の更新   */

        if ( ( cnt % 16 ) == 15 ) {     /* 1行の終了                  */
            pos_y++ ;                   /* 次の行へ                   */
            pos_x = BASE_X3 ;           /* ベース座標(X)の戻し        */
        }                               /* end if                     */
    }                                   /* end for                    */

    refresh() ;                         /* ウィンドウの再描画         */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - lang_ascii_ebcdic */
}                                       /* end (lang_ascii_ebcdic)    */

/**********************************************************************/
