/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Date    : Dec 1998 - Sep 2000                                 */
/* @(#) Version : 2.2                                                 */
/* @(#) Release : 1                                                   */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  ASCII表示関数 - lang_ascii                                        */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   文字データを、ASCII表示する。                                    */
/**********************************************************************/
vd  lang_ascii( struct ifa_s *ifa )     /* ASCII表示関数              */
{
    li           cnt         ;          /* ループカウンタ             */
    li           pos_x       ;          /* X座標                      */
    li           pos_y       ;          /* Y座標                      */
    uc           char_data   ;          /* 文字データ                 */

    trace_start( ifa, "lang_ascii" ) ;  /* トレース取得               */
/* ------------------------------------------------------------------ */
/* 初期設定                                                           */
/* ------------------------------------------------------------------ */
    pos_x = BASE_X3 ;                   /* ベース座標(X)の設定        */
    pos_y = BASE_Y ;                    /* ベース座標(Y)の設定        */

/* ------------------------------------------------------------------ */
/* データの表示                                                       */
/* ------------------------------------------------------------------ */
    for ( cnt = ifa->view_offset ; cnt < ifa->size ; cnt++ ) {
                                        /* 全データの処理             */
        if ( pos_y == ( ifa->lines - 1 ) ) {
                                        /* 最終行                     */
            break ;                     /* データ表示の終了           */
        }                               /* end if                     */

/* ------------------------------------------------------------------ */
/* 不可視文字を点(.)に変換する                                        */
/* ------------------------------------------------------------------ */
        if (( ifa->workarea[cnt] >= 0x20 )&&
            ( ifa->workarea[cnt] <= 0x7e )) {
                                        /* 可視文字                   */
            char_data = ifa->workarea[cnt] ;
                                        /* そのまま設定               */
        }                               /* end if                     */
        else {                          /* 不可視文字                 */
            char_data = TEN ;           /* 不可視文字の為,(.)に変換   */
        }                               /* end else                   */

        if ( ifa->search_info != 0x00 ) {
                                        /* 検索後の表示               */
            if ( ( ifa->reverse == REVERSE )&&
                 ( STANDCHECK( cnt ) == 0x01 ) ) {
                                        /* 検索文字列                 */
                standout() ;            /* 強調モード開始             */
                move(pos_y, pos_x) ; printw("%c", char_data) ;
                                        /* 16進データの表示           */
                standend() ;            /* 強調モード終了             */
            }                           /* end if                     */
            else {                      /* 検索文字列以外             */
                move(pos_y, pos_x) ; printw("%c", char_data) ;
                                        /* 16進データの表示           */
            }                           /* end else                   */
        }                               /* end if                     */
        else {                          /* 検索前の表示               */
            move(pos_y, pos_x) ; printw("%c", char_data) ;
                                        /* 16進データの表示           */
        }                               /* end else                   */
        pos_x++ ;                       /* 文字データ表示位置の更新   */

        if ( ( cnt % 16 ) == 15 ) {     /* 1行の終了                  */
            pos_y++ ;                   /* 次の行へ                   */
            pos_x = BASE_X3 ;           /* ベース座標(X)の戻し        */
        }                               /* end if                     */
    }                                   /* end for                    */

    refresh() ;                         /* ウィンドウの再描画         */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - lang_ascii        */
}                                       /* end (lang_ascii)           */

/**********************************************************************/
