/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Date    : Dec 1998 - Oct 2000                                 */
/* @(#) Version : 2.2                                                 */
/* @(#) Release : 1                                                   */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <string.h>
#include    <hi_std.h>

/**********************************************************************/
/*  Shift-JIS表示関数 - lang_sjis_sjis                                */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   文字データを、Shift-JIS表示する。                                */
/**********************************************************************/
vd  lang_sjis_sjis( struct ifa_s *ifa ) /* Shift-JIS表示関数          */
{
    li           cnt ;                  /* ループカウンタ             */
    li           pos_x ;                /* X座標                      */
    li           pos_y ;                /* Y座標                      */
    li           offset ;               /* オフセット                 */
    uc           check[2] ;             /* チェックデータ             */
    uc           char_data[32] ;        /* 文字データ                 */
    ch           word_flg ;             /* 2バイト文字フラグ          */

    trace_start( ifa, "lang_sjis_sjis" ) ;
                                        /* トレース取得               */
/* ------------------------------------------------------------------ */
/* 初期設定                                                           */
/* ------------------------------------------------------------------ */
    pos_x = BASE_X3 ;                   /* ベース座標(X)の設定        */
    pos_y = BASE_Y ;                    /* ベース座標(Y)の設定        */
    offset = 0 ;                        /* オフセットの設定           */
    word_flg = 0 ;                      /* 2バイト文字フラグの初期化  */
    memset( char_data, 0x00, 32 ) ;     /* 文字データの初期化         */

/* ------------------------------------------------------------------ */
/* データチェック                                                     */
/* ------------------------------------------------------------------ */
    if ( ifa->view_offset > 0 ) {       /* 2バイト目以降              */
        memcpy(check, &ifa->workarea[ifa->view_offset-1], 2) ;
                                        /* チェックデータ(2バイト)取得*/
        if ((((check[0] >= 0x81)&&(check[0] <= 0x9f))||
             ((check[0] >= 0xe0)&&(check[0] <= 0xfc)))&&
            (((check[1] >= 0x40)&&(check[1] <= 0x7e))||
             ((check[1] >= 0x80)&&(check[1] <= 0xfc)))) {
                                        /* 2バイト文字の2バイト目     */
            word_flg = 1 ;              /* 2バイト文字処理中          */
        }                               /* end if                     */
    }                                   /* end if                     */

/* ------------------------------------------------------------------ */
/* データの表示                                                       */
/* ------------------------------------------------------------------ */
    for ( cnt = ifa->view_offset ; cnt < ifa->size ; cnt++ ) {
                                        /* 全データの処理             */
        if ( pos_y == ( ifa->lines - 1 ) ) {
                                        /* 最終行                     */
            break ;                     /* データ表示の終了           */
        }                               /* end if                     */

/* ------------------------------------------------------------------ */
/* 文字コードをチェックする                                           */
/* ------------------------------------------------------------------ */
        char_data[16] = 0x20 ;          /* エリア外の1バイトにを設定  */
        memcpy(check, &ifa->workarea[cnt], 2) ;
                                        /* チェックデータ(2バイト)取得*/
        if ( word_flg == 0 ) {          /* 1バイト文字処理中          */
            if ((((check[0] >= 0x81)&&(check[0] <= 0x9f))||
                 ((check[0] >= 0xe0)&&(check[0] <= 0xfc)))&&
                (((check[1] >= 0x40)&&(check[1] <= 0x7e))||
                 ((check[1] >= 0x80)&&(check[1] <= 0xfc)))) {
                                        /* 可視文字(2バイト文字)      */
                word_flg = 1 ;          /* 2バイト文字の設定          */
                if ( offset == 15 ) {   /* 行の最後                   */
                    memcpy( &char_data[offset], check, 2 ) ;
                                        /* そのまま設定               */
                    offset++ ;          /* オフセットの更新           */
                }                       /* end if                     */
                else {                  /* 行の途中                   */
                    memcpy( &char_data[offset], check, 2 ) ;
                                        /* そのまま設定               */
                    offset += 2 ;       /* オフセットの更新           */
                }                       /* end else                   */
            }                           /* end if                     */
            else if ((check[0] >= 0x20)&&(check[0] <= 0x7e)) {
                                        /* 可視文字(1バイト文字)      */
                char_data[offset] = check[0] ;
                                        /* そのまま設定               */
                offset++ ;              /* オフセットの更新           */
            }                           /* end else if                */
            else {                      /* 不可視文字                 */
                char_data[offset] = TEN ;
                                        /* 不可視文字の為,(.)に変換   */
                offset++ ;              /* オフセットの更新           */
            }                           /* end else                   */
        }                               /* end if                     */
        else {                          /* 2バイト文字処理中          */
            word_flg = 0 ;              /* 2バイト文字の解除          */
            if ( offset == 0 ) {        /* 行の先頭                   */
                char_data[offset] = '@' ;
                                        /* 特殊文字の設定             */
                offset++ ;              /* オフセットの更新           */
            }                           /* end if                     */
        }                               /* end else                   */

        if ( ( cnt % 16 ) == 15 ) {     /* 1行の終了                  */
            move(pos_y, pos_x) ;        /* カーソルの移動             */
            printw("%.17s", char_data) ;/* 文字データの表示           */
            pos_y++ ;                   /* 次の行へ                   */
            offset = 0 ;                /* オフセットの初期化         */
        }                               /* end if                     */
    }                                   /* end for                    */

    refresh() ;                         /* ウィンドウの再描画         */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - lang_sjis_sjis    */
}                                       /* end (lang_sjis_sjis)       */

/**********************************************************************/
