/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 2006 Tatsuyoshi                                   */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  カーソル行最終移動関数 - move_line_end                            */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソルを行の最終に移動し、ウィンドウを再描画する。             */
/**********************************************************************/
vd  move_line_end( struct ifa_s *ifa )   /* カーソル行最終移動関数    */
{
    trace_start( ifa, "move_line_end" ) ;/* トレース取得              */
/* ------------------------------------------------------------------ */
/* カーソルを行の最終に移動                                           */
/* ------------------------------------------------------------------ */
    if( ( ifa->data_offset % 16 ) == 0 ) {
        trace_end( ifa ) ;              /* トレース取得               */
        return ;                        /* return - move_line_end     */
    }
    ifa->data_offset += 16 - ( ( ifa->data_offset ) % 16) ;
                                        /* データオフセットの更新     */
    if ( ifa->data_offset > ifa->size ) {
                                        /* 領域を超えて指定           */
        trace_end( ifa ) ;              /* トレース取得               */
        tail_view( ifa );
        return ;                        /* return - move_line_end     */
    }
                                        /* 最終行以外                 */
    if ( ifa->target == HEX_DATA ) {    /* HEXデータエリア            */
        ifa->cur_pos_x = BASE_X2 + ( 15 * 3 );
                                        /* カーソル位置(X)の設定      */
    } else {                            /* 文字データエリア           */
        ifa->cur_pos_x = BASE_X3 + 15;  /* カーソル位置(X)の設定      */
    }                                   /* end else                   */
    data_view( ifa ) ;                  /* データ表示                 */
    move(OFST_Y, OFST_X) ;              /* カーソル移動               */
    printw("%08x", ifa->data_offset - 1) ;
                                        /* オフセットの表示           */
    move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
    ifa->hex_pos = CUR_LEFT ;           /* 上位バイトをポイントした事 */
                                        /* を覚える                   */
    refresh() ;                         /* ウィンドウ再描画           */
    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - move_line_end     */
}                                       /* end (move_line_end)        */
/**********************************************************************/
