/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 2006 Tatsuyoshi                                   */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  カーソル行先頭終移動関数 - move_line_start                        */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソルを行の先頭に移動し、ウィンドウを再描画する。             */
/**********************************************************************/
vd  move_line_start( struct ifa_s *ifa )/* カーソル行先頭終移動関数   */
{
    trace_start( ifa, "move_line_start" ) ;
                                        /* トレース取得               */
/* ------------------------------------------------------------------ */
/* カーソルを行の先頭に移動                                           */
/* ------------------------------------------------------------------ */
    if ( ifa->target == HEX_DATA ) {    /* HEXデータエリア            */
        ifa->cur_pos_x = BASE_X2 ;      /* カーソル位置(X)の設定      */
    } else {                            /* 文字データエリア           */
        ifa->cur_pos_x = BASE_X3 ;      /* カーソル位置(X)の設定      */
    }                                   /* end else                   */
    ifa->data_offset -= ( ifa->data_offset - 1 ) % 16 ;
                                        /* データオフセットの更新     */
    data_view( ifa ) ;                  /* データ表示                 */
    move(OFST_Y, OFST_X) ;              /* カーソル移動               */
    printw("%08x", ifa->data_offset - 1) ;
                                        /* オフセットの表示           */
    move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
    ifa->hex_pos = CUR_LEFT ;           /* 上位バイトをポイントした事 */
                                        /* を覚える                   */
    refresh() ;                         /* ウィンドウ再描画           */
    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - move_line_start   */
}                                       /* end (move_line_start)      */
/**********************************************************************/
