/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  カーソル上移動関数 - repeat_move_k                                */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソルを上移動し、ウィンドウを再描画する。                     */
/**********************************************************************/
vd  repeat_move_k( struct ifa_s *ifa, li number )
                                        /* カーソル上移動関数         */
{
    ul           data_offset ;          /* データオフセット(ワーク)   */

    trace_start( ifa, "repeat_move_k" ) ;
                                        /* トレース取得               */
/* ------------------------------------------------------------------ */
/* 移動なし                                                           */
/* ------------------------------------------------------------------ */
    if ( ( ifa->size < 16 ) || ( ifa->data_offset + 16 < 0 ) ) {
                                        /* １行以下                   */
        trace_end( ifa ) ;              /* トレース取得               */
        return ;                        /* return - repeat_move_k     */
    }
/* ------------------------------------------------------------------ */
/* カーソルを上に移動                                                 */
/* ------------------------------------------------------------------ */
    if( ( ifa->data_offset - 1 - ( 16 * number ) ) < 0 ) {
                                        /* データ範囲外               */
        data_offset = ( ifa->data_offset - 1 ) % 16 + 1 ;
                                        /* 先頭位置                   */
        number = (ifa->data_offset - data_offset) / 16 ;
                                        /* 改行数設定                 */
    } else {                            /* データ範囲内               */
        data_offset = ifa->data_offset - (16 * number) ;
                                        /* データオフセット設定       */
    }                                   /* end if                     */
    ifa->data_offset = data_offset ;
/* ------------------------------------------------------------------ */
/* 表示中                                                             */
/* ------------------------------------------------------------------ */
    if ( ifa->view_offset < ifa->data_offset ) {
                                        /* 表示中の位置               */
        ifa->cur_pos_y -= number ;      /* カーソル位置(Y座標)の更新  */
        move(OFST_Y, OFST_X) ;          /* カーソル移動               */
        printw("%08x", ifa->data_offset - 1) ;
                                        /* オフセットの表示           */
        move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
        refresh() ;                     /* ウィンドウ再描画           */
        trace_end( ifa ) ;              /* トレース取得               */
        return ;                        /* return - repeat_move_k     */

    }                                   /* end if                     */
/* ------------------------------------------------------------------ */
/* データ表示位置の変更                                               */
/* ------------------------------------------------------------------ */
    if ( ( ifa->data_offset % 16 ) == 0 ) {
        ifa->view_offset = ifa->data_offset;
                                        /* 表示オフセットの更新       */
    } else {
        ifa->view_offset = ifa->data_offset - ( ifa->data_offset % 16 ) ;
                                        /* 表示オフセットの更新       */
    }
    data_view( ifa ) ;                  /* データ表示                 */
    ifa->cur_pos_y = BASE_Y ;
    move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
    refresh() ;                         /* ウィンドウ再描画           */
    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - repeat_move_k     */
}                                       /* end (repeat_move_k)        */

/**********************************************************************/
