/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  カーソル下移動関数 - repeat_move_j                                */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   カーソルを下移動し、ウィンドウを再描画する。                     */
/**********************************************************************/
vd  repeat_move_j( struct ifa_s *ifa, li number )
                                        /* カーソル下移動関数         */
{
    li           pos_tail ;             /* データ表示領域の下         */
    ul           data_offset ;          /* データオフセット(ワーク)   */

    trace_start( ifa, "repeat_move_j" ) ;
                                        /* トレース取得               */
/* ------------------------------------------------------------------ */
/* 移動なし                                                           */
/* ------------------------------------------------------------------ */
    if ( ( ifa->size < 16 ) || ( ifa->data_offset + 16 > ifa->size) ) {
                                        /* １行以下                   */
        trace_end( ifa ) ;              /* トレース取得               */
        return ;                        /* return - repeat_move_j     */
    }
    data_offset = ifa->data_offset + (16 * number);
                                        /* データオフセット設定       */
/* ------------------------------------------------------------------ */
/* カーソルを下に移動                                                 */
/* ------------------------------------------------------------------ */
    if ( data_offset > ifa->size ) {    /* 領域を超えて指定           */
        data_offset = ifa->size - ( ( ifa->size - ifa->data_offset ) % 16 );
                                        /* 最終位置                   */
        number = (data_offset - ifa->data_offset) / 16;
                                        /* 改行数設定                 */
    }                                   /* end if                     */

    ifa->data_offset = data_offset;     /* データオフセットの更新     */
/* ------------------------------------------------------------------ */
/* 表示中                                                             */
/* ------------------------------------------------------------------ */
    pos_tail = ifa->lines - 1 - number; /* 最終行の設定               */
    if ( ifa->cur_pos_y < pos_tail ) {
                                        /* カーソル位置が、最終行以外 */
        ifa->cur_pos_y += number ;      /* カーソル位置(Y座標)の更新  */
        move(OFST_Y, OFST_X) ;          /* カーソル移動               */
        printw("%08x", ifa->data_offset - 1) ;
                                        /* オフセットの表示           */
        move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
        refresh() ;                     /* ウィンドウ再描画           */
        trace_end( ifa ) ;              /* トレース取得               */
        return ;                        /* return - repeat_move_j     */

    }                                   /* end if                     */
/* ------------------------------------------------------------------ */
/* データ表示位置を末尾行の先頭に位置付ける                           */
/* ------------------------------------------------------------------ */
    if ( ifa->size > (ifa->lines - BASE_Y - 2) * 16) {
        if ( ( ifa->data_offset % 16 ) == 0 ) {
                                        /* 行の最終位置               */
            ifa->view_offset = ifa->data_offset - 16
                                         - (ifa->lines - BASE_Y - 2 ) * 16;
                                        /* 表示オフセットの更新       */
        } else {                        /* 行の最終位置以外           */
            ifa->view_offset = ifa->data_offset - ( ifa->data_offset % 16 )
                                         - (ifa->lines - BASE_Y - 2 ) * 16;
                                        /* 表示オフセットの更新       */
        }                               /* end else                   */
    } else {
        ifa->view_offset = 0 ;
    }                                   /* end else                   */
    data_view( ifa ) ;                  /* データ表示                 */

/* ------------------------------------------------------------------ */
/* カーソル表示位置を末尾に位置付ける                                 */
/* ------------------------------------------------------------------ */
    if ( ifa->data_offset > (ifa->lines - BASE_Y - 2) * 16) {
        ifa->cur_pos_y = ifa->lines - 2 ;
                                        /* カーソル位置(Y)の設定      */
    } else {
        if ( ( ifa->data_offset % 16 ) == 0 ) {
                                        /* 行の最終位置               */
            ifa->cur_pos_y = (ifa->data_offset / 16) + (BASE_Y - 1) ;
        } else {                        /* 行の最終位置以外           */
            ifa->cur_pos_y = (ifa->data_offset / 16) + BASE_Y ;
                                        /* カーソル位置(Y)の設定      */
        }
    }                                   /* end else                   */
    move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
    ifa->hex_pos = CUR_LEFT ;           /* 上位バイトをポイントした事 */
                                        /* を覚える                   */
    refresh() ;                         /* ウィンドウ再描画           */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - repeat_move_j     */
}                                       /* end (repeat_move_j)        */

/**********************************************************************/
