/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <string.h>
#include    <hi_std.h>

/**********************************************************************/
/*  文字列:HEX変換関数 - str_hex_cnv                                  */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   文字列をHEXデータに変換する。                                    */
/**********************************************************************/
vd  str_hex_cnv( struct ifa_s *ifa )    /* 文字列:HEX変換関数         */
{
    li           cnt      ;             /* ループカウンタ             */
    li           offset   ;             /* バイナリデータオフセット   */
    li           size     ;             /* サーチデータサイズ         */
    uc           moji     ;             /* 対象の１文字               */
    uc           data[64] ;             /* サーチデータ               */

    trace_start( ifa, "str_hex_cnv" ) ; /* トレース取得               */
/* ------------------------------------------------------------------ */
/* 初期設定                                                           */
/* ------------------------------------------------------------------ */
    offset = 0 ;                        /* オフセットの初期化         */
    size = 0 ;                          /* サーチデータサイズの初期化 */
    memset( data, 0x00, sizeof( data ) ) ;
                                        /* サーチデータの初期化       */
/* ------------------------------------------------------------------ */
/* サーチ文字列判定                                                   */
/* ------------------------------------------------------------------ */
    for ( cnt = 2 ; cnt < ifa->search_size ; cnt++ ) {
                                        /* 文字:バイナリデータ変換    */
        CHAR_TO_HEX( (moji), (ifa->search_str[cnt]) ) ;
                                        /* 文字をHEXに変換する        */
        if ( ( cnt % 2 ) == 0 ) {       /* 上位バイト                 */
            data[offset] = moji << 4 ;  /* 上位バイト設定             */
        }                               /* end if                     */
        else {                          /* 下位バイト                 */
            data[offset++] |= moji ;    /* 下位バイト設定             */
        }                               /* end else                   */
    }                                   /* end for                    */
    size = offset ;                     /* サーチデータサイズの設定   */

/* ------------------------------------------------------------------ */
/* サーチデータ再設定                                                 */
/* ------------------------------------------------------------------ */
    memcpy( ifa->search_str, data, size + 1 ) ;
                                        /* サーチデータ再設定         */
    ifa->search_size = size ;           /* サーチデータサイズ再設定   */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - str_hex_cnv       */
}                                       /* end (str_hex_cnv)          */

/**********************************************************************/
