/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  末尾表示関数 - tail_view                                          */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   データ表示位置を末尾行の先頭に位置付け、カーソルを最終位置に     */
/*   移動する。                                                       */
/**********************************************************************/
vd  tail_view( struct ifa_s *ifa )      /* 末尾表示関数               */
{
    trace_start( ifa, "tail_view" ) ;   /* トレース取得               */

    if ( ifa->size < 1 ) {
        trace_end( ifa ) ;              /* トレース取得               */
        return ;                        /* return - tail_view         */
    }

/* ------------------------------------------------------------------ */
/* データ表示位置を末尾行の先頭に位置付ける                           */
/* ------------------------------------------------------------------ */
    ifa->data_offset = ifa->size ;      /* データオフセットの更新     */
    if ( ifa->size > (ifa->lines - BASE_Y - 2) * 16) {
        if ( ( ifa->size % 16 ) == 0 ) {
                                        /* 行の最終位置               */
            ifa->view_offset = ifa->size - 16 
                                         - (ifa->lines - BASE_Y - 2 ) * 16;
                                        /* 表示オフセットの更新       */
        } else {                        /* 行の最終位置以外           */
            ifa->view_offset = ifa->size - ( ifa->size % 16 ) 
                                         - (ifa->lines - BASE_Y - 2 ) * 16;
                                        /* 表示オフセットの更新       */
        }                               /* end else                   */
    } else {
        ifa->view_offset = 0 ; 
    }
    data_view( ifa ) ;                  /* データ表示                 */

/* ------------------------------------------------------------------ */
/* カーソル表示位置を末尾に位置付ける                                 */
/* ------------------------------------------------------------------ */
    if ( ifa->target == HEX_DATA ) {    /* HEXデータエリア            */
        if ( ( ifa->size % 16 ) == 0 ) {/* 行の最終位置               */
            ifa->cur_pos_x = BASE_X2 + ( 15 * 3 );
                                        /* カーソル位置(X)の設定      */
        } else {                        /* 行の最終位置以外           */
            ifa->cur_pos_x = BASE_X2 + ( ifa->size % 16 ) * 3 - 3;
                                        /* カーソル位置(X)の設定      */
        }                               /* end if                     */
    } else {                            /* 文字データエリア           */
        if ( ( ifa->size % 16 ) == 0 ) {/* 行の最終位置               */
            ifa->cur_pos_x = BASE_X3 + 15 ;
                                        /* カーソル位置(X)の設定      */
        } else {                          /* 行の最終位置以外           */
            ifa->cur_pos_x = BASE_X3 + ( ifa->size % 16 ) - 1 ;
                                        /* カーソル位置(X)の設定      */
        }                               /* end if                     */
    }                                   /* end else                   */
    if ( ifa->size > (ifa->lines - BASE_Y - 2) * 16) {
        ifa->cur_pos_y = ifa->lines - 2 ;
                                        /* カーソル位置(Y)の設定      */
    } else {
        if ( ( ifa->size % 16 ) == 0 ) {/* 行の最終位置               */
            ifa->cur_pos_y = (ifa->size / 16) + (BASE_Y - 1) ;
        } else {                        /* 行の最終位置以外           */
            ifa->cur_pos_y = (ifa->size / 16) + BASE_Y ;
                                        /* カーソル位置(Y)の設定      */
        }
    }
    move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
    ifa->hex_pos = CUR_LEFT ;           /* 上位バイトをポイントした事 */
                                        /* を覚える                   */
    refresh() ;                         /* ウィンドウ再描画           */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - tail_view         */
}                                       /* end (tail_view)            */

/**********************************************************************/
