/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Modifier: Tatsuyoshi                                          */
/* @(#) Date    : Nov 2006                                            */
/* @(#) Version : 2.4                                                 */
/* @(#) Release : 3t                                                  */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/*    Copyright (c) 2004-2006 Tatsuyoshi                              */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <hi_std.h>

/**********************************************************************/
/*  先頭表示関数 - top_view                                           */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   データ表示位置を先頭に位置付け、カーソルを移動する。             */
/**********************************************************************/
vd  top_view( struct ifa_s *ifa )       /* 先頭表示関数               */
{

    trace_start( ifa, "top_view" ) ;    /* トレース取得               */
/* ------------------------------------------------------------------ */
/* データ表示位置を先頭に位置付ける                                   */
/* ------------------------------------------------------------------ */
    ifa->data_offset = 1 ;              /* データオフセットの更新     */
    ifa->view_offset = 0 ;              /* 表示オフセットの更新       */
    data_view( ifa ) ;                  /* データ表示                 */

/* ------------------------------------------------------------------ */
/* カーソル表示位置を先頭に位置付ける                                 */
/* ------------------------------------------------------------------ */
    if ( ifa->target == HEX_DATA ) {    /* HEXデータエリア            */
        ifa->cur_pos_x = BASE_X2 ;      /* カーソル位置(X)の設定      */
    }                                   /* end if                     */
    else {                              /* 文字データエリア           */
        ifa->cur_pos_x = BASE_X3 ;      /* カーソル位置(X)の設定      */
    }                                   /* end else                   */
    ifa->cur_pos_y = BASE_Y ;           /* カーソル位置(Y)の設定      */
    move(ifa->cur_pos_y, ifa->cur_pos_x) ;
                                        /* カーソル移動               */
    ifa->hex_pos = CUR_LEFT ;           /* 上位バイトをポイントした事 */
                                        /* を覚える                   */
    refresh() ;                         /* ウィンドウ再描画           */

    trace_end( ifa ) ;                  /* トレース取得               */
    return ;                            /* return - top_view          */
}                                       /* end (top_view)             */

/**********************************************************************/
