/**********************************************************************/
/*  hi - バイナリエディタ                                             */
/* ------------------------------------------------------------------ */
/* @(#) Author  : Kazunori Mita (mita@maroon.plala.or.jp)             */
/* @(#) Date    : Dec 1998 - Sep 2000                                 */
/* @(#) Version : 2.2                                                 */
/* @(#) Release : 1                                                   */
/* ------------------------------------------------------------------ */
/*    Copyright (c) 1998-2000 Kazunori Mita. All right reserved.      */
/**********************************************************************/
/* ================================================================== */
/* インクルードファイル                                               */
/* ================================================================== */
#include    <string.h>
#include    <hi_std.h>

/**********************************************************************/
/*  関数終了関数 - trace_end                                          */
/* ------------------------------------------------------------------ */
/* 関数概要                                                           */
/*   トレース情報(終了)を取得する。                                   */
/**********************************************************************/
vd  trace_end( struct ifa_s *ifa )      /* 関数終了関数               */
{

#ifdef TRACE
{
    ul    cnt ;                         /* ループカウンタ             */

    memset( ifa->debug_msg, 0x00, sizeof( ifa->debug_msg ) ) ;
                                        /* デバッグメッセージエリアの */
                                        /* 初期化                     */
    for ( cnt = 0 ; cnt < ifa->func_dep ; cnt++ ) {
                                        /* ネスト分ループ             */
        strlcat( ifa->debug_msg, "  ", sizeof( ifa->debug_msg ) ) ;
                                        /* ネスト分スペースを挿入     */
    }                                   /* end for                    */
    strlcat( ifa->debug_msg, "[E]", sizeof( ifa->debug_msg ) ) ;
                                        /* 標識を設定                 */

    debug( ifa ) ;                      /* デバッグ関数               */
}
#endif

    ifa->func_dep-- ;                   /* 関数トレースの深さを設定   */

    return ;                            /* return - trace_end         */
}                                       /* end (trace_end)            */

/**********************************************************************/
